Revit 2026 API

# BuiltInFailuresScaleFailures Class

---

Failures about Scale.

SystemObject Autodesk.Revit.DBBuiltInFailuresScaleFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ScaleFailures
```
```vb
Public NotInheritable Class ScaleFailures
```
```cpp
public ref class ScaleFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ScaleFailures = class end
```

The BuiltInFailuresScaleFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotScaleLinkWithSharedCoordinates | Can't scale link that shares coordinates with host model |

#### Reference

Autodesk.Revit.DB Namespace